In [48]:
import pandas as pd

In [49]:
ufo=pd.read_csv("http://bit.ly/uforeports")

In [50]:
ufo.head()

                   City Colors Reported Shape Reported State             Time
0                Ithaca             NaN       TRIANGLE    NY   6/1/1930 22:00
1           Willingboro             NaN          OTHER    NJ  6/30/1930 20:00
2               Holyoke             NaN           OVAL    CO  2/15/1931 14:00
3               Abilene             NaN           DISK    KS   6/1/1931 13:00
4  New York Worlds Fair             NaN          LIGHT    NY  4/18/1933 19:00

In [51]:
type(ufo.City)

pandas.core.series.Series

In [52]:
type(ufo['City'])

pandas.core.series.Series

In [53]:
ufo['Location']=ufo.City+","+ufo.State

In [54]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Time,Location
0,Ithaca,NaN,TRIANGLE,NY,6/1/1930 22:00,"Ithaca,NY"
1,Willingboro,NaN,OTHER,NJ,6/30/1930 20:00,"Willingboro,NJ"
2,Holyoke,NaN,OVAL,CO,2/15/1931 14:00,"Holyoke,CO"
3,Abilene,NaN,DISK,KS,6/1/1931 13:00,"Abilene,KS"
4,New York Worlds Fair,NaN,LIGHT,NY,4/18/1933 19:00,"New York Worlds Fair,NY"

In [56]:
new = ufo["Time"].str.split(" ", n = 1, expand = True) 
  
# making separate first name column from new data frame 
ufo["Date"]= new[0] 
  
# making separate last name column from new data frame 
ufo["When"]= new[1] 
  
# Dropping old Name columns 
ufo.drop(columns =["Time"], inplace = True)

In [57]:
ufo.head()

,City,Colors Reported,Shape Reported,State,Location,Date,When
0,Ithaca,NaN,TRIANGLE,NY,"Ithaca,NY",6/1/1930,22:00
1,Willingboro,NaN,OTHER,NJ,"Willingboro,NJ",6/30/1930,20:00
2,Holyoke,NaN,OVAL,CO,"Holyoke,CO",2/15/1931,14:00
3,Abilene,NaN,DISK,KS,"Abilene,KS",6/1/1931,13:00
4,New York Worlds Fair,NaN,LIGHT,NY,"New York Worlds Fair,NY",4/18/1933,19:00